In [117]:
import pandas as pd
import numpy as np

In [139]:
df2 = pd.DataFrame(np.random.randint(0,100,size=(5, 4)), columns=list('ABCD'))

In [140]:
df2.head()

    A   B   C   D
0  33  13  85  52
1  10  94  10  93
2  85  36  46  43
3   9  87   9  41
4  71   5  40  43

In [141]:
df2.tail()

    A   B   C   D
0  33  13  85  52
1  10  94  10  93
2  85  36  46  43
3   9  87   9  41
4  71   5  40  43

In [142]:
df2.shape

(5, 4)

In [143]:
df2.describe()

               A          B          C          D
count   5.000000   5.000000   5.000000   5.000000
mean   41.600000  47.000000  38.000000  54.400000
std    34.939948  41.382363  31.232995  21.995454
min     9.000000   5.000000   9.000000  41.000000
25%    10.000000  13.000000  10.000000  43.000000
50%    33.000000  36.000000  40.000000  43.000000
75%    71.000000  87.000000  46.000000  52.000000
max    85.000000  94.000000  85.000000  93.000000

In [144]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int32
 1   B       5 non-null      int32
 2   C       5 non-null      int32
 3   D       5 non-null      int32
dtypes: int32(4)
memory usage: 208.0 bytes

In [147]:
df2['A']

0    33
1    10
2    85
3     9
4    71
Name: A, dtype: int32

In [150]:
df2[['A','B']]

    A   B
0  33  13
1  10  94
2  85  36
3   9  87
4  71   5

In [151]:
df2['A'].value_counts()

71    1
85    1
9     1
10    1
33    1
Name: A, dtype: int64

In [153]:
df2.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [154]:
df.isnull().sum()

A    0
B    0
C    0
D    0
F    0
dtype: int64

In [161]:
df2.iloc[1:5,1:4]

    B   C   D
1  94  10  93
2  36  46  43
3  87   9  41
4   5  40  43

In [159]:
df2.iloc[:,:].values

array([[33, 13, 85, 52],
       [10, 94, 10, 93],
       [85, 36, 46, 43],
       [ 9, 87,  9, 41],
       [71,  5, 40, 43]])

In [163]:
df2['A'].value_counts()

71    1
85    1
9     1
10    1
33    1
Name: A, dtype: int64

In [164]:
df2['A'].unique()

array([33, 10, 85,  9, 71])

In [171]:
df2[df2['A']>50]

    A   B   C   D
2  85  36  46  43
4  71   5  40  43